genokolar/nrf52-keyboard/application/main/src/ble/ble_services.c
#ifdef MACADDR_SEPRATOR
    int orig_len = strlen(DEVICE_NAME);
    int name_len = orig_len + 8;
    char device_name[name_len];
    get_device_name(device_name, orig_len);

    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)device_name, strlen(device_name));
#else
    err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t*)DEVICE_NAME, strlen(DEVICE_NAME));
#endif
    APP_ERROR_CHECK(err_code);
}
/**@brief 切换连接设备.
 *
 * @param[in] id  要切换的设备的ID号
 */
void switch_device_id(uint8_t id)
{
    ret_code_t ret;
    ble_gap_addr_t gap_addr;
    if (id == switch_id) {
        return; //如果重复切换，则直接退出，不做任何操作
    }
    switch_id = id;

    eeconfig_write_switch_id(id);

    ret = sd_ble_gap_addr_get(&gap_addr);
    APP_ERROR_CHECK(ret);

    gap_addr.addr[3] = id; // switch status 1, 2, or 3

    ret = sd_ble_gap_addr_set(&gap_addr);
    APP_ERROR_CHECK(ret);

    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        sd_ble_gap_adv_stop(m_advertising.adv_handle);
        set_device_name();
        ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        //sd_ble_gap_adv_start(m_advertising.adv_handle, BLE_CONN_CFG_TAG_DEFAULT);
    } else {
        status_led_display();
        sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    }
}
/**@brief 切换连接设备初始化.
 *
 * 读取存储的当前连接设备ID，并激活为当前连接设备
 */
static void switch_device_init()
{

    ret_code_t ret;
    ble_gap_addr_t gap_addr;
    switch_id = eeconfig_read_switch_id();

    ret = pm_id_addr_get(&gap_addr);
    APP_ERROR_CHECK(ret);

    gap_addr.addr[3] = switch_id;

    ret = pm_id_addr_set(&gap_addr);
    APP_ERROR_CHECK(ret);
}

/**@brief Clear bond information from persistent storage.
 */
void delete_bonds(void)
{
    ret_code_t err_code;

    ble_disconnect();

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
    
    //清空所有绑定后，自动回到首个设备
    switch_id = 0;
    eeconfig_write_switch_id(switch_id);
    switch_device_id(switch_id);
}

void delete_bond_id(uint8_t id)
{
    ret_code_t err_code;

    ble_disconnect();

    err_code = pm_peer_delete(id);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true) {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    } else {
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

        ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(ret);
    }
}

void advertising_slow()
{
    ret_code_t ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_SLOW);
    APP_ERROR_CHECK(ret);
}

static void disconnect(uint16_t conn_handle, void* p_context)
{
    UNUSED_PARAMETER(p_context);

    sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

static void advertising_config_get(ble_adv_modes_config_t* p_config)
{
    memset(p_config, 0, sizeof(ble_adv_modes_config_t));

    p_config->ble_adv_whitelist_enabled = true;
    p_config->ble_adv_directed_high_duty_enabled = true;
    p_config->ble_adv_directed_enabled = false;
    p_config->ble_adv_directed_interval = 0;
    p_config->ble_adv_directed_timeout = 0;
    p_config->ble_adv_fast_enabled = true;
    p_config->ble_adv_fast_interval = APP_ADV_FAST_INTERVAL;
    p_config->ble_adv_fast_timeout = APP_ADV_FAST_DURATION;
    p_config->ble_adv_slow_enabled = true;
    p_config->ble_adv_slow_interval = APP_ADV_SLOW_INTERVAL;
    p_config->ble_adv_slow_timeout = APP_ADV_SLOW_DURATION;
    p_config->ble_adv_on_disconnect_disabled = false;
}

/**@brief Function for handling dfu events from the Buttonless Secure DFU service
 *
 * @param[in]   event   Event from the Buttonless Secure DFU service.
 */
static void ble_dfu_evt_handler(ble_dfu_buttonless_evt_type_t event)
{
    switch (event) {
    case BLE_DFU_EVT_BOOTLOADER_ENTER_PREPARE: {
        // Prevent device from advertising on disconnect.
        ble_adv_modes_config_t config;
        advertising_config_get(&config);
        config.ble_adv_on_disconnect_disabled = true;
        ble_advertising_modes_config_set(&m_advertising, &config);

        // Disconnect all other bonded devices that currently are connected.
        // This is required to receive a service changed indication
        // on bootup after a successful (or aborted) Device Firmware Update.
        ble_conn_state_for_each_connected(disconnect, NULL);
        break;
    }

    case BLE_DFU_EVT_BOOTLOADER_ENTER:
        // YOUR_JOB: Write app-specific unwritten data to FLASH, control finalization of this
        //           by delaying reset by reporting false in app_shutdown_handler
        break;

    case BLE_DFU_EVT_BOOTLOADER_ENTER_FAILED:
        // YOUR_JOB: Take corrective measures to resolve the issue
        //           like calling APP_ERROR_CHECK to reset the device.
        APP_ERROR_CHECK(false);
        break;

    case BLE_DFU_EVT_RESPONSE_SEND_ERROR:
        // YOUR_JOB: Take corrective measures to resolve the issue
        //           like calling APP_ERROR_CHECK to reset the device.
        APP_ERROR_CHECK(false);
        break;

    default:
        break;
    }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const* p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id) {
    case PM_EVT_CONN_SEC_SUCCEEDED:
        m_peer_id = p_evt->peer_id;
        event_handler(USER_BLE_CONNECTED);
        break;
    case PM_EVT_BONDED_PEER_CONNECTED:
        event_handler(USER_BLE_CONNECTED);
        break;

    case PM_EVT_PEERS_DELETE_SUCCEEDED:
        advertising_start(false);
        break;

    case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        if (p_evt->params.peer_data_update_succeeded.flash_changed && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING)) {
            // Note: You should check on what kind of white list policy your application should use.

            whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
        }
        break;

    default:
        break;
    }
}

void restart_advertising_no_whitelist()
{
    ret_code_t err_code;
    if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {
        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
        if (err_code != NRF_ERROR_INVALID_STATE) {
            APP_ERROR_CHECK(err_code);
        }
    }
}


